Revit 2027 API
BuiltInFailures.WallJoinRoofFailures Class
 Failures about WallJoinRoof.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class WallJoinRoofFailures
Public NotInheritable Class WallJoinRoofFailures
public ref class WallJoinRoofFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type WallJoinRoofFailures = class end
The BuiltInFailures.WallJoinRoofFailures type exposes the following members.
Properties
Name | Description
NoFromRoofForWall |  Highlighted wall is set to be "From roof", however there is no roof below it that can be used.
NotCoveredAtAllByTarget |  Highlighted walls are attached to, but miss, the highlighted targets.
NoUptoRoofForWall |  Highlighted wall is set to be "Up to roof", however there is no roof above it that can be used.
WallMeetsRoofTangentially |  The highlighted wall cannot be joined to the highlighted roof because the wall meets the roof tangentially.
WallNotCoveredByRoof |  The highlighted wall(s) cannot be joined to the highlighted roof because the roof does not entirely cover the wall(s).
Top
See Also
Reference
Autodesk.Revit.DB Namespace